import Image from "next/image";
import localFont from "next/font/local";
import styles from "./page.module.css";

const abraham = localFont({
  src: "../fonts/Abraham-Regular-TRIAL.otf",
  display: "swap",
});

export default function DesignPage() {
  return (
    <main className={`${styles.page} ${abraham.className}`} dir="rtl">
      <div className={styles.phoneFrame}>
        
        {/* כרטיס עליון עם תמונה */}
        <section className={`${styles.card} ${styles.cardTop}`}>
            <div className={styles.imageWrapper}>
            <Image
                src="/design-image.png"      // אותו שם קובץ כמו ב-public
                alt="פעילות בישול"
                fill
                className={styles.image}
            />
            </div>
          <p>“הוואטסאפ של עולמות הבישול” - פלטפורמה שבה כל קבוצה היא שילוב של תוכן מקצועי, השראה, וקהילה חיה ופעילה סביב העולם הקולינרי.
          </p>
        </section>

        {/* כרטיס ירוק */}
        <section className={`${styles.card} ${styles.cardGreen}`}>
          <p>
המצב הנוכחי כיום הוא שאנשים שאוהבים לבשל או מחפשים מתכונים צריכים לעבור בין פלטפורמות רבות- אתרי בישול, קבוצות פייסבוק, סרטוני טיקטוק או אינסטגרם. בעינינו התוצאה היא שהחוויה מפוזרת, פחות נגישה, ולעיתים גם מתסכלת, במיוחד כשמנסים לבשל תוך כדי שימוש בטלפון ולא במחשב.
          </p>
        </section>

        {/* כרטיס כתום אמצעי */}
        <section className={`${styles.card} ${styles.cardOrange}`}>
          <p>
המניע שלנו הוא להפוך את עולם המתכונים לחוויה אינטראקטיבית, חברתית ונגישה יותר. המטרה שלנו היא שהמוצר שלנו ישלב בין תקשורת מיידית, בדומה לוואטסאפ, לבין עולם התוכן הקולינרי בצורה בה משתמשים יוכלו לשתף מתכונים, להתייעץ בזמן אמת, לקבל פידבק, וליצור קהילות סביב תחומי עניין או משפיעני רשת ושפים המתמחים באופן בישול מסוים. אנחנו שואפים לשנות את הדרך שבה אנשים צורכים ומתנסים במתכונים, לא רק לקרוא, אלא גם לדבר, לשאול וללמוד זה מזה. המטרה היא לייעל את תהליך הבישול, לחזק תחושת קהילה, ולהפוך את המטבח למקום חווייתי ושיתופי.
          </p>
        </section>

        {/* כרטיס אדום */}
        <section className={`${styles.card} ${styles.cardRed}`}>
          <p>
מקור התוכן באפליקציה מבוסס על מתכונים שמועלים על ידי המשתמשים בקבוצות השיתוף, לצד מתכונים של משפיעני אוכל בקבוצות הסגורות. המידע באפליקציה הוא דינמי ומשתנה באופן יומיומי, ונוצר באופן אורגני על ידי המשתמשים עצמם. כדי לשמור על איכות ודיוק, תופעל בקרת תוכן בסיסית שתאפשר דיווח על פרסומים שאינם מתאימים. ניהול התוכן יתבצע באמצעות ממשק פשוט שיאפשר טיפול במתכונים, תגובות ודיווחים. המידע האישי של המשתמשים- כגון שם, תמונה ופרטים אישיים נוספים יהיה מוגן בהתאם למדיניות פרטיות
          </p>
        </section>

      </div>
    </main>
  );
}